sownlee/MCAL/env/STM32F407VG/header/Header_MCU.h
#if !defined(HEADER_MCU_H_)  
#define HEADER_MCU_H_

#include "Header.h"

/*Define register for RCC module*/
typedef struct
{
	__IO uint32_t CR;		      /* RCC clock control register,                                   */
	__IO uint32_t PLLCFGR;	      /* RCC PLL configuration register,                               */
	__IO uint32_t CFGR;		      /* RCC clock configuration register,                             */
	__IO uint32_t CIR;		      /* RCC clock interrupt register,                                 */
	__IO uint32_t AHB1RSTR;	      /* RCC AHB1 peripheral reset register,                           */
	__IO uint32_t AHB2RSTR;	      /* RCC AHB2 peripheral reset register,                           */
	__IO uint32_t AHB3RSTR;	      /* RCC AHB3 peripheral reset register,                           */
	uint32_t RESERVED0;		      /* Reserved, 0x1C                                                */
	__IO uint32_t APB1RSTR;	      /* RCC APB1 peripheral reset register,                           */
	__IO uint32_t APB2RSTR;	      /* RCC APB2 peripheral reset register,                           */
	uint32_t RESERVED1[2];	      /* Reserved, 0x28-0x2C                                           */
	__IO uint32_t AHB1ENR;	      /* RCC AHB1 peripheral clock register,                           */
	__IO uint32_t AHB2ENR;	      /* RCC AHB2 peripheral clock register,                           */
	__IO uint32_t AHB3ENR;	      /* RCC AHB3 peripheral clock register,                           */
	uint32_t RESERVED2;		      /* Reserved, 0x3C                                                */
	__IO uint32_t APB1ENR;	      /* RCC APB1 peripheral clock enable register,                    */
	__IO uint32_t APB2ENR;	      /* RCC APB2 peripheral clock enable register,                    */
	uint32_t RESERVED3[2];	      /* Reserved, 0x48-0x4C                                           */
	__IO uint32_t AHB1LPENR;      /* RCC AHB1 peripheral clock enable in low power mode register   */
	__IO uint32_t AHB2LPENR;      /* RCC AHB2 peripheral clock enable in low power mode register   */
	__IO uint32_t AHB3LPENR;      /* RCC AHB3 peripheral clock enable in low power mode register   */
	uint32_t RESERVED4;		      /* Reserved, 0x5C                                                */
	__IO uint32_t APB1LPENR;      /* RCC APB1 peripheral clock enable in low power mode register   */
	__IO uint32_t APB2LPENR;      /* RCC APB2 peripheral clock enable in low power mode register   */
	uint32_t RESERVED5[2];	      /* Reserved, 0x68-0x6C                                           */
	__IO uint32_t BDCR;		      /* RCC Backup domain control register,                           */
	__IO uint32_t CSR;		      /* RCC clock control & status register,                          */
	uint32_t RESERVED6[2];	      /* Reserved, 0x78-0x7C                                           */
	__IO uint32_t SSCGR;	      /* RCC spread spectrum clock generation register,                */
	__IO uint32_t PLLI2SCFGR;     /* RCC PLLI2S configuration register,                            */
} RCC_RegDef_t;
#define RCC ((RCC_RegDef_t *)RCC_BASEADDR)

/** 
  *  Power Control
*/
typedef struct
{
  __IO uint32_t CR;   /* PWR power control register        */
  __IO uint32_t CSR;  /* PWR power control/status register */
} PWR_TypeDef_t;
#define PWR                 ((PWR_TypeDef_t *) PWR_BASEADDR)

#define RCC_MAX_FREQUENCY           168000000U         /* Max frequency of family in Hz*/
#define RCC_MAX_FREQUENCY_SCALE1    RCC_MAX_FREQUENCY  /* Maximum frequency for system clock at power scale1, in Hz */
#define RCC_MAX_FREQUENCY_SCALE2    144000000U         /* Maximum frequency for system clock at power scale2, in Hz */
#define RCC_PLLVCO_OUTPUT_MIN       100000000U         /* Frequency min for PLLVCO output, in Hz */
#define RCC_PLLVCO_INPUT_MIN           950000U         /* Frequency min for PLLVCO input, in Hz  */
#define RCC_PLLVCO_INPUT_MAX          2100000U         /* Frequency max for PLLVCO input, in Hz  */
#define RCC_PLLVCO_OUTPUT_MAX       432000000U         /* Frequency max for PLLVCO output, in Hz */

/*  Bit definition PWR_CR */
#define PWR_CR_LPDS_Pos        (0U)                                            
#define PWR_CR_LPDS_Msk        (0x1UL << PWR_CR_LPDS_Pos)                     
#define PWR_CR_LPDS            PWR_CR_LPDS_Msk                                
#define PWR_CR_PDDS_Pos        (1U)                                           
#define PWR_CR_PDDS_Msk        (0x1UL << PWR_CR_PDDS_Pos)                     
#define PWR_CR_PDDS            PWR_CR_PDDS_Msk                                
#define PWR_CR_CWUF_Pos        (2U)                                           
#define PWR_CR_CWUF_Msk        (0x1UL << PWR_CR_CWUF_Pos)                     
#define PWR_CR_CWUF            PWR_CR_CWUF_Msk                                
#define PWR_CR_CSBF_Pos        (3U)                                           
#define PWR_CR_CSBF_Msk        (0x1UL << PWR_CR_CSBF_Pos)                     
#define PWR_CR_CSBF            PWR_CR_CSBF_Msk                                
#define PWR_CR_PVDE_Pos        (4U)                                           
#define PWR_CR_PVDE_Msk        (0x1UL << PWR_CR_PVDE_Pos)                     
#define PWR_CR_PVDE            PWR_CR_PVDE_Msk                                

#define PWR_CR_PLS_Pos         (5U)                                           
#define PWR_CR_PLS_Msk         (0x7UL << PWR_CR_PLS_Pos)                      
#define PWR_CR_PLS             PWR_CR_PLS_Msk                                 
#define PWR_CR_PLS_0           (0x1UL << PWR_CR_PLS_Pos)                      
#define PWR_CR_PLS_1           (0x2UL << PWR_CR_PLS_Pos)                      
#define PWR_CR_PLS_2           (0x4UL << PWR_CR_PLS_Pos)                      

/* PVD level configuration */
#define PWR_CR_PLS_LEV0        0x00000000U                                    
#define PWR_CR_PLS_LEV1        0x00000020U                                  
#define PWR_CR_PLS_LEV2        0x00000040U                                  
#define PWR_CR_PLS_LEV3        0x00000060U                                  
#define PWR_CR_PLS_LEV4        0x00000080U                                  
#define PWR_CR_PLS_LEV5        0x000000A0U                                  
#define PWR_CR_PLS_LEV6        0x000000C0U                                  
#define PWR_CR_PLS_LEV7        0x000000E0U                                  
#define PWR_CR_DBP_Pos         (8U)                                         
#define PWR_CR_DBP_Msk         (0x1UL << PWR_CR_DBP_Pos)                    
#define PWR_CR_DBP             PWR_CR_DBP_Msk                               
#define PWR_CR_FPDS_Pos        (9U)                                         
#define PWR_CR_FPDS_Msk        (0x1UL << PWR_CR_FPDS_Pos)                   
#define PWR_CR_FPDS            PWR_CR_FPDS_Msk                              
#define PWR_CR_VOS_Pos         (14U)                                        
#define PWR_CR_VOS_Msk         (0x1UL << PWR_CR_VOS_Pos)                    
#define PWR_CR_VOS             PWR_CR_VOS_Msk                               

/*******************  Bit definition for PWR_CSR register  ********************/
#define PWR_CSR_WUF_Pos        (0U)                                            
#define PWR_CSR_WUF_Msk        (0x1UL << PWR_CSR_WUF_Pos)                   
#define PWR_CSR_WUF            PWR_CSR_WUF_Msk                              
#define PWR_CSR_SBF_Pos        (1U)                                         
#define PWR_CSR_SBF_Msk        (0x1UL << PWR_CSR_SBF_Pos)                   
#define PWR_CSR_SBF            PWR_CSR_SBF_Msk                              
#define PWR_CSR_PVDO_Pos       (2U)                                         
#define PWR_CSR_PVDO_Msk       (0x1UL << PWR_CSR_PVDO_Pos)                  
#define PWR_CSR_PVDO           PWR_CSR_PVDO_Msk                             
#define PWR_CSR_BRR_Pos        (3U)                                         
#define PWR_CSR_BRR_Msk        (0x1UL << PWR_CSR_BRR_Pos)                   
#define PWR_CSR_BRR            PWR_CSR_BRR_Msk                              
#define PWR_CSR_EWUP_Pos       (8U)                                         
#define PWR_CSR_EWUP_Msk       (0x1UL << PWR_CSR_EWUP_Pos)                  
#define PWR_CSR_EWUP           PWR_CSR_EWUP_Msk                             
#define PWR_CSR_BRE_Pos        (9U)                                         
#define PWR_CSR_BRE_Msk        (0x1UL << PWR_CSR_BRE_Pos)                   
#define PWR_CSR_BRE            PWR_CSR_BRE_Msk                              
#define PWR_CSR_VOSRDY_Pos     (14U)                                        
#define PWR_CSR_VOSRDY_Msk     (0x1UL << PWR_CSR_VOSRDY_Pos)                
#define PWR_CSR_VOSRDY         PWR_CSR_VOSRDY_Msk                           





/*  Bit definition for RCC_CR register */
#define RCC_CR_HSION_Pos                   (0U)                                
#define RCC_CR_HSION_Msk                   (0x1UL << RCC_CR_HSION_Pos)        
#define RCC_CR_HSION                       RCC_CR_HSION_Msk                   
#define RCC_CR_HSIRDY_Pos                  (1U)                               
#define RCC_CR_HSIRDY_Msk                  (0x1UL << RCC_CR_HSIRDY_Pos)       
#define RCC_CR_HSIRDY                      RCC_CR_HSIRDY_Msk                  

#define RCC_CR_HSITRIM_Pos                 (3U)                               
#define RCC_CR_HSITRIM_Msk                 (0x1FUL << RCC_CR_HSITRIM_Pos)     
#define RCC_CR_HSITRIM                     RCC_CR_HSITRIM_Msk                 
#define RCC_CR_HSITRIM_0                   (0x01UL << RCC_CR_HSITRIM_Pos)     
#define RCC_CR_HSITRIM_1                   (0x02UL << RCC_CR_HSITRIM_Pos)     
#define RCC_CR_HSITRIM_2                   (0x04UL << RCC_CR_HSITRIM_Pos)     
#define RCC_CR_HSITRIM_3                   (0x08UL << RCC_CR_HSITRIM_Pos)     
#define RCC_CR_HSITRIM_4                   (0x10UL << RCC_CR_HSITRIM_Pos)     

#define RCC_CR_HSICAL_Pos                  (8U)                               
#define RCC_CR_HSICAL_Msk                  (0xFFUL << RCC_CR_HSICAL_Pos)      
#define RCC_CR_HSICAL                      RCC_CR_HSICAL_Msk                  
#define RCC_CR_HSICAL_0                    (0x01UL << RCC_CR_HSICAL_Pos)      
#define RCC_CR_HSICAL_1                    (0x02UL << RCC_CR_HSICAL_Pos)      
#define RCC_CR_HSICAL_2                    (0x04UL << RCC_CR_HSICAL_Pos)      
#define RCC_CR_HSICAL_3                    (0x08UL << RCC_CR_HSICAL_Pos)      
#define RCC_CR_HSICAL_4                    (0x10UL << RCC_CR_HSICAL_Pos)      
#define RCC_CR_HSICAL_5                    (0x20UL << RCC_CR_HSICAL_Pos)      
#define RCC_CR_HSICAL_6                    (0x40UL << RCC_CR_HSICAL_Pos)      
#define RCC_CR_HSICAL_7                    (0x80UL << RCC_CR_HSICAL_Pos)      

#define RCC_CR_HSEON_Pos                   (16U)                              
#define RCC_CR_HSEON_Msk                   (0x1UL << RCC_CR_HSEON_Pos)        
#define RCC_CR_HSEON                       RCC_CR_HSEON_Msk                   
#define RCC_CR_HSERDY_Pos                  (17U)                              
#define RCC_CR_HSERDY_Msk                  (0x1UL << RCC_CR_HSERDY_Pos)       
#define RCC_CR_HSERDY                      RCC_CR_HSERDY_Msk                  
#define RCC_CR_HSEBYP_Pos                  (18U)                              
#define RCC_CR_HSEBYP_Msk                  (0x1UL << RCC_CR_HSEBYP_Pos)       
#define RCC_CR_HSEBYP                      RCC_CR_HSEBYP_Msk                  
#define RCC_CR_CSSON_Pos                   (19U)                              
#define RCC_CR_CSSON_Msk                   (0x1UL << RCC_CR_CSSON_Pos)        
#define RCC_CR_CSSON                       RCC_CR_CSSON_Msk                   
#define RCC_CR_PLLON_Pos                   (24U)                              
#define RCC_CR_PLLON_Msk                   (0x1UL << RCC_CR_PLLON_Pos)        
#define RCC_CR_PLLON                       RCC_CR_PLLON_Msk                   
#define RCC_CR_PLLRDY_Pos                  (25U)                              
#define RCC_CR_PLLRDY_Msk                  (0x1UL << RCC_CR_PLLRDY_Pos)       
#define RCC_CR_PLLRDY                      RCC_CR_PLLRDY_Msk     

