sownlee/MCAL/env/STM32F407VG/header/Header_MCU.h
#define RCC_PLLI2S_SUPPORT                                                
#define RCC_CR_PLLI2SON_Pos                (26U)                          
#define RCC_CR_PLLI2SON_Msk                (0x1UL << RCC_CR_PLLI2SON_Pos) 
#define RCC_CR_PLLI2SON                    RCC_CR_PLLI2SON_Msk            
#define RCC_CR_PLLI2SRDY_Pos               (27U)                          
#define RCC_CR_PLLI2SRDY_Msk               (0x1UL << RCC_CR_PLLI2SRDY_Pos)
#define RCC_CR_PLLI2SRDY                   RCC_CR_PLLI2SRDY_Msk           

#define RCC_PLLCFGR_PLLM_Pos               (0U)                                
#define RCC_PLLCFGR_PLLM_Msk               (0x3FUL << RCC_PLLCFGR_PLLM_Pos)    
#define RCC_PLLCFGR_PLLM                   RCC_PLLCFGR_PLLM_Msk               
#define RCC_PLLCFGR_PLLM_0                 (0x01UL << RCC_PLLCFGR_PLLM_Pos)    
#define RCC_PLLCFGR_PLLM_1                 (0x02UL << RCC_PLLCFGR_PLLM_Pos)    
#define RCC_PLLCFGR_PLLM_2                 (0x04UL << RCC_PLLCFGR_PLLM_Pos)    
#define RCC_PLLCFGR_PLLM_3                 (0x08UL << RCC_PLLCFGR_PLLM_Pos)    
#define RCC_PLLCFGR_PLLM_4                 (0x10UL << RCC_PLLCFGR_PLLM_Pos)    
#define RCC_PLLCFGR_PLLM_5                 (0x20UL << RCC_PLLCFGR_PLLM_Pos)    

#define RCC_PLLCFGR_PLLN_Pos               (6U)                               
#define RCC_PLLCFGR_PLLN_Msk               (0x1FFUL << RCC_PLLCFGR_PLLN_Pos)   
#define RCC_PLLCFGR_PLLN                   RCC_PLLCFGR_PLLN_Msk               
#define RCC_PLLCFGR_PLLN_0                 (0x001UL << RCC_PLLCFGR_PLLN_Pos)   
#define RCC_PLLCFGR_PLLN_1                 (0x002UL << RCC_PLLCFGR_PLLN_Pos)   
#define RCC_PLLCFGR_PLLN_2                 (0x004UL << RCC_PLLCFGR_PLLN_Pos)   
#define RCC_PLLCFGR_PLLN_3                 (0x008UL << RCC_PLLCFGR_PLLN_Pos)   
#define RCC_PLLCFGR_PLLN_4                 (0x010UL << RCC_PLLCFGR_PLLN_Pos)   
#define RCC_PLLCFGR_PLLN_5                 (0x020UL << RCC_PLLCFGR_PLLN_Pos)   
#define RCC_PLLCFGR_PLLN_6                 (0x040UL << RCC_PLLCFGR_PLLN_Pos)   
#define RCC_PLLCFGR_PLLN_7                 (0x080UL << RCC_PLLCFGR_PLLN_Pos)   
#define RCC_PLLCFGR_PLLN_8                 (0x100UL << RCC_PLLCFGR_PLLN_Pos)   

#define RCC_PLLCFGR_PLLP_Pos               (16U)                              
#define RCC_PLLCFGR_PLLP_Msk               (0x3UL << RCC_PLLCFGR_PLLP_Pos)     
#define RCC_PLLCFGR_PLLP                   RCC_PLLCFGR_PLLP_Msk               
#define RCC_PLLCFGR_PLLP_0                 (0x1UL << RCC_PLLCFGR_PLLP_Pos)     
#define RCC_PLLCFGR_PLLP_1                 (0x2UL << RCC_PLLCFGR_PLLP_Pos)     

#define RCC_PLLCFGR_PLLSRC_Pos             (22U)                              
#define RCC_PLLCFGR_PLLSRC_Msk             (0x1UL << RCC_PLLCFGR_PLLSRC_Pos)   
#define RCC_PLLCFGR_PLLSRC                 RCC_PLLCFGR_PLLSRC_Msk             
#define RCC_PLLCFGR_PLLSRC_HSE_Pos         (22U)                               
#define RCC_PLLCFGR_PLLSRC_HSE_Msk         (0x1UL << RCC_PLLCFGR_PLLSRC_HSE_Pos) 
#define RCC_PLLCFGR_PLLSRC_HSE             RCC_PLLCFGR_PLLSRC_HSE_Msk          
#define RCC_PLLCFGR_PLLSRC_HSI             0x00000000U                         

#define RCC_PLLCFGR_PLLQ_Pos               (24U)                               
#define RCC_PLLCFGR_PLLQ_Msk               (0xFUL << RCC_PLLCFGR_PLLQ_Pos)      
#define RCC_PLLCFGR_PLLQ                   RCC_PLLCFGR_PLLQ_Msk                
#define RCC_PLLCFGR_PLLQ_0                 (0x1UL << RCC_PLLCFGR_PLLQ_Pos)      
#define RCC_PLLCFGR_PLLQ_1                 (0x2UL << RCC_PLLCFGR_PLLQ_Pos)      
#define RCC_PLLCFGR_PLLQ_2                 (0x4UL << RCC_PLLCFGR_PLLQ_Pos)      
#define RCC_PLLCFGR_PLLQ_3                 (0x8UL << RCC_PLLCFGR_PLLQ_Pos)      


/********************  Bit definition for RCC_CFGR register  ******************/
/* SW configuration */
#define RCC_CFGR_SW_Pos                    (0U)                                
#define RCC_CFGR_SW_Msk                    (0x3UL << RCC_CFGR_SW_Pos)       
#define RCC_CFGR_SW                        RCC_CFGR_SW_Msk                  
#define RCC_CFGR_SW_0                      (0x1UL << RCC_CFGR_SW_Pos)       
#define RCC_CFGR_SW_1                      (0x2UL << RCC_CFGR_SW_Pos)       

#define RCC_CFGR_SW_HSI                    0x00000000U                      
#define RCC_CFGR_SW_HSE                    0x00000001U                      
#define RCC_CFGR_SW_PLL                    0x00000002U                      

/* SWS configuration */
#define RCC_CFGR_SWS_Pos                   (2U)                             
#define RCC_CFGR_SWS_Msk                   (0x3UL << RCC_CFGR_SWS_Pos)      
#define RCC_CFGR_SWS                       RCC_CFGR_SWS_Msk                 
#define RCC_CFGR_SWS_0                     (0x1UL << RCC_CFGR_SWS_Pos)      
#define RCC_CFGR_SWS_1                     (0x2UL << RCC_CFGR_SWS_Pos)      

#define RCC_CFGR_SWS_HSI                   0x00000000U                      
#define RCC_CFGR_SWS_HSE                   0x00000004U                      
#define RCC_CFGR_SWS_PLL                   0x00000008U                      

/* HPRE configuration */
#define RCC_CFGR_HPRE_Pos                  (4U)                                
#define RCC_CFGR_HPRE_Msk                  (0xFUL << RCC_CFGR_HPRE_Pos)      
#define RCC_CFGR_HPRE                      RCC_CFGR_HPRE_Msk                 
#define RCC_CFGR_HPRE_0                    (0x1UL << RCC_CFGR_HPRE_Pos)      
#define RCC_CFGR_HPRE_1                    (0x2UL << RCC_CFGR_HPRE_Pos)      
#define RCC_CFGR_HPRE_2                    (0x4UL << RCC_CFGR_HPRE_Pos)      
#define RCC_CFGR_HPRE_3                    (0x8UL << RCC_CFGR_HPRE_Pos)      

#define RCC_CFGR_HPRE_DIV1                 0x00000000U                       
#define RCC_CFGR_HPRE_DIV2                 0x00000080U                       
#define RCC_CFGR_HPRE_DIV4                 0x00000090U                       
#define RCC_CFGR_HPRE_DIV8                 0x000000A0U                       
#define RCC_CFGR_HPRE_DIV16                0x000000B0U                       
#define RCC_CFGR_HPRE_DIV64                0x000000C0U                       
#define RCC_CFGR_HPRE_DIV128               0x000000D0U                       
#define RCC_CFGR_HPRE_DIV256               0x000000E0U                       
#define RCC_CFGR_HPRE_DIV512               0x000000F0U                       

